Repository: Anastasia1944/SudokuCo
Catalog: SudokuCo/*.lproj/Localizable.strings
Languages: ru

source: My Games
ru: Мои Игры

source: Game Library
ru: Библиотека Игр

source: Statistics
ru: Статистика

source: Easy
ru: Легкий

source: Medium
ru: Средний

source: Hard
ru: Трудный

source: Expert
ru: Экспертный

source: Cancel
ru: Отмена

source: Delete
ru: Удалить

source: Write
ru: Написать

source: Continue
ru: Продолжить

source: Add
ru: Добавить

source: Ok
ru: Ок

source: Notes
ru: Заметки

source: Tip
ru: Подсказка

source: App Info
ru: Информация

# Feedback
source: If you have any suggestions or questions, please write them to this email: sudokuCoGame@outlook.com
ru: Если у вас есть какие-либо вопросы или предложения по улучшению, напишите на эту почту: sudokuCoGame@outlook.com

# Statistics Not Saving
source: This Game will not be saved in statistics. Play from the "My Games" to save it.
ru: Эта игра не будет сохранена в статистике. Перейдите в раздел "Мои игры" для сохранения.

source: Don't show again
ru: Больше не показывать

source: from My Games?
ru: из Мои Игры?

source: to My Games?
ru: в Мои Игры?

# No Games Yet
source: There are no games yet
ru: Пока нет игр

source: Go to Game Library
ru: Перейдите в Библиотеку Игр

# No Statistics
source: There are no statistics now
ru: Статистики пока нет

# Play Some Games
source: Play some games at My Games
ru: Сыграйте игры из Мои Игры

source: Games Won
ru: Выиграно

source: Games Played
ru: Игр Сыграно

source: Win rate
ru: Процент выигрыша

source: Average Time
ru: Среднее время

source: Show Time
ru: Показывать время

source: Auto-Check for Mistakes
ru: Авто-проверка ошибок

source: Auto-Delete for Notes
ru: Авто-удаление заметок

# Classic Sudoku Info
source: Task - to fill empty cells with numbers from 1 to 9 in such way: in each horizontal row, vertical column, square block each number occurs only once.
ru: Задача - заполнить пустые ячейки номерами от 1 до 9 таким образом, чтобы в каждой строке, каждом столбце, каждой области 3*3 каждое число встречалось только однажды.

# Comparison Sudoku Info
source: Task - to fill empty cells with numbers from 1 to 9 in such way: in each horizontal row, vertical column, square block each number occurs only once. Also it has comparison signs (“>” and “<”), showing the ratio of numbers in adjacent cells.
ru: Задача - заполнить пустые ячейки номерами от 1 до 9 таким образом, чтобы в каждой строке, каждом столбце, каждой области 3*3 каждое число встречалось только однажды. Также появляются знаки сравнения (“>” and “<”), которые отображают отношение чисел в соседних ячейках.

# Dots Sudoku Info
source: Task - to fill empty cells with numbers from 1 to 9 in such way: in each horizontal row, vertical column, square block each number occurs only once. If in neighboring cells one number is twice as large as the other, there is a black dot between them. If the numbers in neighboring cells differ by one, the dot between them is white.
ru: Задача - заполнить пустые ячейки номерами от 1 до 9 таким образом, чтобы в каждой строке, каждом столбце, каждой области 3*3 каждое число встречалось только однажды. Если разница чисел в соседних ячейках в два раза, между ними стоит черная точка. Если разница чисел в соседних ячейках на один, между ними стоит белая точка.

# Frame Sudoku Info
source: Task - to fill empty cells with numbers from 1 to 9 in such way: in each horizontal row, vertical column, square block each number occurs only once. This variant of Sudoku contains numbers around the grid instead of the usual task. Each of the numbers represents the sum of the nearest three digits in a row or column.
ru: Задача - заполнить пустые ячейки номерами от 1 до 9 таким образом, чтобы в каждой строке, каждом столбце, каждой области 3*3 каждое число встречалось только однажды. В этом варианте судоку добавляются числа вокруг сетки. Каждое такое число показывает сумму ближайших трех чисел в строке или столбце.

# Odd-Even Sudoku Info
source: Task - to fill empty cells with numbers from 1 to 9 in such way: in each horizontal row, vertical column, square block each number occurs only once. In this variant of Sudoku, information is given about the evenness or oddness of the numbers in the cells. Cells with odd numbers are marked with circles.
ru: Задача - заполнить пустые ячейки номерами от 1 до 9 таким образом, чтобы в каждой строке, каждом столбце, каждой области 3*3 каждое число встречалось только однажды. В этом варианте судоку имеется дополнительная информация о четности/нечетности числа в ячейке. Если число четное, в ячейку добавляется окружность.

# 2D Sudoku Info
source: Task - to fill empty cells with numbers from 1 to 9 in such way: in each horizontal row and vertical column each number occurs only once. In this puzzle, unlike the classic Sudoku, there is no block limit.
ru: Задача - заполнить пустые ячейки номерами от 1 до 9 таким образом, чтобы в каждой строке, каждом столбце каждое число встречалось только однажды. В этом типе судоку нет ограничения по блокам 3*3.

# No Neighbors Info
source: Task - to fill empty cells with numbers from 1 to 9 in such way: in each horizontal row and vertical column each number occurs only once. In neighboring cells, separated by a bold line, there are consecutive numbers. Numbers without a line between them cannot be consecutive.
ru: Задача - заполнить пустые ячейки номерами от 1 до 9 таким образом, чтобы в каждой строке, каждом столбце каждое число встречалось только однажды. В соседних ячейках, которые разделены жирной линией, числа различаются на единицу. Если такой линии нет, числа не могут быть различаться на единицу.

# Mathrax Info
source: Task - to fill empty cells with numbers from 1 to 9 in such way: in each horizontal row and vertical column each number occurs only once. In some nodes of the grid there are circles with information about the ratio of numbers adjacent to them. Either the number and sign of a mathematical operation (+, -, *, /), where the number is the result of this operation applied to both pairs of numbers in diagonally adjacent cells. Or an "E" or "O" - if all four adjacent numbers even or odd. If several operations can be correlated the surrounding numbers - operation is chosen randomly. If no circle is assign to the surroundings numbers, there is no any correlation.
ru: Задача - заполнить пустые ячейки номерами от 1 до 9 таким образом, чтобы в каждой строке, каждом столбце каждое число встречалось только однажды. На некоторых пересечениях сетки находятся круги, в которых находится информация о числах в окружающих ее ячейках. Или математическая операция (+, -, /, *), где число является результатом этой операции, примененной к обеим парам чисел в соседних по диагонали ячейках. Или "E" or "O", если все четыре окружающих числа четные или нечетные. Если могут быть применены несколько операций, операция выбирается случайным образом.

# Killer Sudoku Info
source: Task - to fill empty cells with numbers from 1 to 9 in such way: in each horizontal row, vertical column, square block each number occurs only once. This variant of Sudoku contains areas with numbers - each number is the sum of the digits inside the corresponding area. In each area each number can occur only once.
ru: Задача - заполнить пустые ячейки номерами от 1 до 9 таким образом, чтобы в каждой строке, каждом столбце, каждой области 3*3 каждое число встречалось только однажды. Этот вариант судоку содержит области с числами — каждое число представляет собой сумму цифр внутри соответствующей области. В каждой области каждое число может встречаться только один раз.

# Easy As ABC Info
source: Task - to complete the puzzle with letters from the given range in such way: in each row and column each letter occurs only once. Some cells may remain empty. The letters on the border of the grid show which letter will appear first in a given row (column).
ru: Задача - заполнить поле буквами из указанногодиапазона таким образом, чтобы в каждом ряду и колонке каждая буква встречалась лишь однажды. Некоторые клетки могут оставаться пустыми. Буквы на границе сетки показывают, какая буква встретится первой в данном ряду или колонке.

# Skyscrapers Info
source: Here is a top view of the city block. In each cell there is a "skyscraper" with a height equal to the number in this cell. The numbers on the sides of the grid indicate the number of "skyscrapers" visible from the corresponding row or column when viewed from that number. Task - to fill empty cells with numbers from 1 to 9 in such way: in each horizontal row and vertical column each number occurs only once.
ru: Перед вами вид сверху городского квартала. Каждая клетка обозначает небоскреб, высота которого равна числу в клетке. Числа вокруг сетки обозначают количество небоскребов, которые видно с соответствующей стороны. Задача - заполнить пустые ячейки номерами от 1 до 9 таким образом, чтобы в каждой строке, каждом столбце каждое число встречалось только однажды.
